# CreateThreeStateCheckBox

## Description
Creates a Layout Manager three state checkbox.

```pascal
PROCEDURE CreateThreeStateCheckBox(
				dialogID    : LONGINT;
				componentID : LONGINT;
				strName     : STRING);
```

```python

def vs.CreateThreeStateCheckBox(dialogID, componentID, strName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|strName|STRING||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern